#+STARTUP: indent

#+OPTIONS: num:nil toc:nil reveal_history:t
#+PROPERTY: header-args :eval no-export

#+include: reveal_header.org :minlevel 1

# 1 hour slot, but should be short with time for questions
#+Title: Building SICMUtils, the Atelier of Abstractions

** Extensible Generics
#+begin_notes
- generic, extensible functions via protocols, multimethods
- `type` vs `kind`
- show library code
- extended to functions!
#+end_notes

  #+begin_src clojure :results value pp :exports both
((square +) 'x 'y)
  #+end_src

  #+RESULTS:
  : (expt (+ x y) 2)
  :

  #+begin_src clojure :results value pp :exports both
((square +) 1 2)
  #+end_src

  #+RESULTS:
  : 9
  :

** Symbolic Computation
#+begin_notes
- simplifier, rules
#+end_notes

#+begin_src clojure :results value pp :exports both
(+ (square (sin 'x))
   (square (cos 'x)))
#+end_src

#+RESULTS:
: (+ (expt (sin x) 2) (expt (cos x) 2))
:

#+begin_src clojure :results value pp :exports both
(simplify
 (+ (square (sin 'x))
    (square (cos 'x))))
#+end_src

#+RESULTS:
: 1
:

** Renderers
#+begin_notes
- obvious, open thing, S-expressions
- simplifier
#+end_notes

Infix:

#+begin_src clojure :exports both
(->infix
 (+ (square (sin 'eta))
    (cube (tan 'phi_2))))
#+end_src

#+RESULTS:
: sin²(η) + (tan(φ₂))³

TeX:

#+begin_src clojure :exports both
(->TeX
 (+ (square (sin 'eta))
    (cube (tan 'phi_2))))
#+end_src

#+RESULTS:
: {\sin}^{2}\left(\eta\right) + {\left(\tan\left({\phi}_2\right)\right)}^{3}

** Renderers

JavaScript Source Renderer

#+begin_src clojure :results value output :exports both
(println
 (->JavaScript
  (+ (square (sin 'eta))
     (cube (tan 'phi-2)))))
#+end_src

#+RESULTS:
: function(eta, phi_2) {
:   return Math.pow(Math.sin(eta), 2) + Math.pow(Math.tan(phi_2), 3);
: }

** Function Compilation
#+begin_notes
- reuses all the stuff above
- you can do this for matrices too!
#+end_notes

#+begin_src clojure :exports both
(defn my-fn [x y]
  (+ x
     (sin y)
     (square (cos 'x))
     (square (sin 'x))
     (cube (sin y))))

(binding [*mode* :source]
  (compile-fn my-fn))
#+end_src

#+RESULTS:
: (clojure.core/fn [x45929 x45930]
:   (clojure.core/let [G0000000000000000 (Math/sin x45930)]
:     (clojure.core/+ (clojure.core/*
:                      -1.0
:                      G0000000000000000
:                      (Math/pow (Math/cos x45930) 2.0))
:                     x45929
:                     (clojure.core/* 2.0 G0000000000000000)
:                    1.0)))

** Type vs Kind
#+begin_notes
- protocol vs multimethod dispatch
- protocols are fast, multimethods are flexible
#+end_notes

#+begin_src  clojure :results value pp :exports both
(map kind [(make-rectangular 1 2) 10 {:k "v"}])
#+end_src

#+RESULTS:
: (:sicmutils.complex/complex
:  java.lang.Long
:  clojure.lang.PersistentArrayMap)
:

** DSL, Pattern Matching:

#+ATTR_REVEAL: :code_attribs data-line-numbers="3-6|8-12|14-17|19-24"
#+begin_src clojure
(require '[pattern.rule :as r :refer [ruleset =>]])

(defn unary-elimination [& ops]
  (let [op-set (into #{} ops)]
    (ruleset
     ((? _ op-set) ?x) => ?x)))

(defn constant-elimination [op constant]
  (letfn [(filter-constants [{xs '??xs}]
            (remove #{constant} xs))]
    (ruleset
     (~op ??xs) => (~op (?? ~filter-constants)))))

(defn constant-promotion [op constant]
  (ruleset
   (~op _ ~constant) => ~constant
   (~op ~constant _) => ~constant))

(def my-simplify
  (r/rule-simplifier
   (unary-elimination '+ '*)
   (constant-elimination '+ 0)
   (constant-elimination '* 1)
   (constant-promotion '* 0)))
#+end_src

#+RESULTS:
| #'prez/unary-elimination    |
| #'prez/constant-elimination |
| #'prez/constant-promotion   |
| #'prez/my-simplify          |

#+REVEAL: split
#+begin_src clojure :results value pp :exports both
(my-simplify
 '(cos (+ 0 (+ 0 12 0) (* 1 x))))
#+end_src

#+RESULTS:
: (cos (+ 12 x))
:

** Multi-Stage Programming
#+begin_notes
- just as easily you could be sending operations off to matrix library... there
  is no reason to prefer Python etc.

  Everything fast there is staged down to FORTRAN etc.
#+end_notes

#+begin_src clojure :exports both
(defn my-fn [x y]
  (+ x
     (sin y)
     (square (cos 'x))
     (square (sin 'x))
     (cube (sin y))))

(binding [*mode* :source]
  (compile-fn my-fn))
#+end_src

#+RESULTS:
: (clojure.core/fn [x45929 x45930]
:   (clojure.core/let [G0000000000000000 (Math/sin x45930)]
:     (clojure.core/+ (clojure.core/*
:                      -1.0
:                      G0000000000000000
:                      (Math/pow (Math/cos x45930) 2.0))
:                     x45929
:                     (clojure.core/* 2.0 G0000000000000000)
:                    1.0)))

